// Напишите программу, которая будет выдавать названия дней недели
//по заданному номеру

Console.WriteLine("Введите номер ");

int day = int.Parse(Console.ReadLine()!);

if (day == 1)
Console.WriteLine("Sunday");

if (day == 2)
Console.WriteLine("Mondey");

if (day == 3)
Console.WriteLine("Tuesday");

if (day == 4)
Console.WriteLine("Wednesday");

if (day == 5)
Console.WriteLine("Thursday");

if (day == 6)
Console.WriteLine("Friday");

if (day == 7)
Console.WriteLine("Saturday");
